[
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-001-Marvin-Gaye-WHATS-GOING-ON.jpg?w=1000",
    "artist": "Marvin Gaye",
    "album": "What's Going On",
    "year": "1971",
    "rank": "1",
    "body1": "Marvin Gaye's masterpiece began as a reaction to police brutality. In May 1969, Renaldo  Benson, the Four Tops' bass singer, watched TV coverage of hundreds of club-wielding cops breaking up the People's Park, a protest hub in Berkeley. Aghast at the violence, Benson began to write a song with Motown lyricist Al Cleveland, trying to capture the confusion and pain of the times. He knew he had something big in his nascent version of “What's Going On,” but the rest of the Four Tops weren't interested, and Benson's efforts to get Joan Baez to record it didn't work out, either.",
    "body2": "But one of Motown's biggest stars and greatest voices turned out to be more receptive. Gaye was in a dark and contemplative place, wounded by the death of his frequent duet partner Tammi Terrell, yearning to sing subtler and more substantive material, and mulling over his brother Frankie's horrifying tales of his recent stint fighting in Vietnam. Gaye had been keeping busy writing for and producing a group called the Originals, and trying to figure out what was next. “I'd been stumbling around for an idea,” he told biographer David Ritz. “I knew there was more inside me. And that was something no record executive or producer could see. But I saw it. I knew I had to get out there.”",
    "body3": "What emerged was soul music's first concept album, and one of the most important and influential LPs ever made. John Legend recently described it as “the voice of black America speaking out that we couldn't always smile on cue for you.” Building it all around one finished song lent What's Going On a musical and thematic through line. “What's Happening Brother” assumes the voice of a Vietnam vet like Gaye's brother, puzzled by a changing America and looking for work; “Mercy Mercy Me (The Ecology)” is a taut ode to the environment; “Flyin' High (In the Friendly Sky)” takes on drug addiction.",
    "body4": "After What's Going On, black musicians at Motown and elsewhere felt a new freedom to push the musical and political boundaries of their art. “When I was struggling for the right of the Motown artist to express himself,” Gaye said, “Stevie [Wonder] knew I was also struggling for him.” At the end of the final song on What's Going On, the lament “Inner City Blues (Make Me Wanna Holler),” the music shifts back into a jazzier reprise of the title track. As the album fades out, the groove continues on. Five decades later, it still hasn't stopped.",
    "audio": "../assets/songs/marvingaye.mp3",
    "id": 1
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-002-Beach-Boys-PET-SOUNDS-update.jpg?w=1000",
    "artist": "The Beach Boys",
    "album": "Pet Sounds",
    "year": "1966",
    "rank": "2",
    "body1": "“Who's gonna hear this shit?” Beach Boys singer Mike Love asked the band's resident genius, Brian Wilson, in 1966, as Wilson played him the new songs he was working on. “The ears of a dog?” Confronted with his bandmate's contempt, Wilson made lemonade of lemons. “Ironically,” he observed, “Mike's barb inspired the album's title.”",
    "body2": "Barking dogs - Wilson's dog Banana among them, in fact - are prominent among the found sounds on the album. The Beatles made a point of echoing them on Sgt. Pepper's Lonely Hearts Club Band - an acknowledgment that Pet Sounds was the inspiration for the Beatles' masterpiece. That gesture actually completed a circle of inﬂuence: Wilson initially conceived of Pet Sounds as an effort to top the Beatles' Rubber Soul. With its vivid orchestration, lyrical ambition, elegant pacing, and thematic coherence, Pet Sounds invented — and in several senses, perfected — the notion that an album could be more than the sum of its parts. When Wilson sang, “Wouldn't it be nice if we were older,” on the album's magnificent opening song, he wasn't just imagining a love that could evolve past high school, he was suggesting a new grown-up identity for rock & roll music itself.",
    "body3": "Wilson made Pet Sounds without the rest of the band, using them only to ﬂesh out the vocal arrangements. He even considered putting the album out as a solo project, and the ﬁrst single, “Caroline, No,” was released under his own name. The personal nature of the songs, which Wilson co-wrote primarily with lyricist Tony Asher, further distinguished the album from the Beach Boys' previous hits. Its luxurious sound conveys a heartbreaking wistfulness, as songs such as “I Just Wasn't Made for These Times” and “I'm Waiting for the Day” bid farewell to the innocent world of the early Sixties.",
    "body4": "The album's centerpiece is “God Only Knows,” arranged with harpsichord, horns, sleigh bells, and strings to create a spiritual feeling Wilson later compared to “being blind, but in being blind, you can see more. You close your eyes; you're able to see a place or something that's happening.” In the years to come, countless artists would live in his vision.",
    "audio": "../assets/songs/beachboys.mp3",
    "id": 2
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-003-JoniMitchell-BLUE-HR.jpg?w=1000",
    "artist": "Joni Mitchell",
    "album": "Blue",
    "year": "1971",
    "rank": "3",
    "body1": "In 1971, Joni Mitchell represented the West Coast feminine ideal — celebrated by Robert Plant as “a girl out there with love in her eyes and flowers in her hair” on Led Zeppelin's “Goin' to California.” It was a status that Mitchell hadn't asked for and did not want: “I went, 'Oh, my God, a lot of people are listening to me,'” she recalled in 2013. “'They better find out who they're worshiping. Let's see if they can take it. Let's get real.' So I wrote Blue.”",
    "body2": "From its smoky, introspective cover to its wholly unguarded approach to songwriting, Blue is the first time any major rock or pop artist had opened up so fully, producing what might be the ultimate breakup album and setting a still-unmatched standard for confessional poetry in pop music. Using acoustic instruments and her octave-leaping voice, Mitchell portrayed herself as a lonely painter, aching to make sense of all her heartbreak. She reflects on past relationships and encounters, including a chef from Crete (“Carey”) and rock luminaries like Graham Nash (“My Old Man”), Leonard Cohen (“A Case of You”), and James Taylor (“This Flight Tonight”), who lent a hand on a few tracks. Along with its romantic melancholy, Blue was the sound of a woman availing herself of the romantic and sexual freedom that was, until then, an exclusively male province in rock.",
    "body3": "The songs had such stark, emotional intensity that it shocked the men around her: “Kris Kristofferson said to me, 'Oh, Joni. Save something for yourself.' The vulnerability freaked them out.” On “Little Green,” she opens up about a baby she had given up for adoption, and on the staggering piano dirge “River,” she takes responsibility for a romance gone wrong, changing the scope of love songs forever: “I'm so hard to handle/I'm selfish, and I'm sad,” she laments. “Now I've gone and lost the best baby/That I ever had.”",
    "body4": "Mitchell continued to release excellent records throughout the Seventies, but Blue remains her masterpiece. “The Blue album, there's hardly a dishonest note in the vocals,” she told Rolling Stone in 1979. “At that period of my life, I had no personal defenses. I felt like a cellophane wrapper on a pack of cigarettes. I felt like I had absolutely no secrets from the world, and I couldn't pretend in my life to be strong. Or to be happy. But the advantage of it in the music was that there were no defenses there either.”",
    "audio": "https://jonimitchell.com/music/mp3/8.mp3",
    "id": 3
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-004-Stevie-Wonder-SONGS-IN-THE-KEY-OF-LIFE.jpg?w=1000",
    "artist": "Stevie Wonder",
    "album": "Songs in the Key of Life",
    "year": "1976",
    "rank": "4",
    "body1": "Months before the recording sessions for Songs in the Key of Life ended, the musicians in Stevie Wonder's band had T-shirts made up that proclaimed, “We're almost finished.” It was the stock answer to casual fans and Motown executives and everybody who'd fallen in love with Wonder's early-Seventies gems - 1972's Talking Book, 1973's Innervisions, and 1974's Fulfillingness' First Finale - and who had been waiting two years for the next chapter. “I believed there was a lot that needed to be said,” Wonder said. More, in fact, than he could fit onto a double album - also included was a bonus EP, a seven-inch single with four more songs from the sessions.",
    "body2": "Songs, released in 1976, encompasses an incredible range of life experiences - from the giddy joy of a baby in the bathtub (“Isn't She Lovely,” featuring the cries and giggles of Wonder's infant daughter Aisha Morris) through tributes to his musical heroes (“Sir Duke”) to dismay about the indifference of the wealthy (“Village Ghetto Land”). Wonder pulled from every imaginable musical source — the ecstatic “Sir Duke” references Duke Elington and Ella Fitzgerald, while “As” featured Herbie Hancock on Fender Rhodes.",
    "body3": "Though Wonder's blindness meant he could record faster by memorizing lyrics, some songs had four or five intricate verses, so somebody had to prompt him. Often it was engineer John Fischbach, reading lines into the headphone mix just seconds before Wonder sang them. “He never got thrown off,” engineer John Fischbach told Rolling Stone years later. “His vocals had so much power.”",
    "body4": "The album's mastery of many styles remains astonishing, but the feat might not have meant so much had Wonder not delivered some of his most impassioned political art as well, like the autobiographical “I Wish,” the takedown of wealthy complacency “Village Ghetto Land,” and, perhaps most movingly, “Black Man,” in which he runs down a funky list of global Afro-diasporic aspirations and heroes. Songs in the Key of Life linked all this together, in Wonder's all-encompassing innervision.",
    "audio": "../../public/assets/songs/steviewonder.mp3",
    "id": 4
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-005-Beatles-ABBEY-ROAD.jpg?w=1000",
    "artist": "The Beatles",
    "album": "Abbey Road",
    "year": "1969",
    "rank": "5",
    "body1": "“It was a very happy record,” said producer George Martin, describing this album in The Beatles Anthology. “I guess it was happy because everybody thought it was going to be the last.” Indeed, Abbey Road — recorded in two months during the summer of 1969 — almost never got made at all.",
    "body2": "That January, the Beatles were on the verge of a breakup, exhausted and angry with one another after the disastrous sessions for the aborted Get Back LP, later salvaged as Let It Be. Yet determined to go out with the same glory with which they had ﬁrst entranced the world at the start of the decade, the group reconvened at EMI's Abbey Road Studios to make their most polished album: a collection of superb songs cut with an attention to reﬁned detail, then segued together (especially on Side Two) with conceptual force.",
    "body3": "There was no thematic link, other than the Beatles' unique genius. John Lennon veered from the stormy metal of “I Want You (She's So Heavy)” to the exquisite vocal sunrise of “Because.” Paul McCartney was saucy (“Oh! Darling”), silly (“Maxwell's Silver Hammer”), and deliciously bitter (“You Never Give Me Your Money”). George Harrison proved his long-secret worth as a composer with “Something” (later covered by Frank Sinatra) and the folk-pop diamond “Here Comes the Sun,” written in his friend Eric Clapton's garden after a grim round of business meetings. Lennon, McCartney, and Harrison reputedly sang more three-part harmonies here than on any other Beatles album. That warm feeling — a sense of an increasingly divided band warmly coming together as friends — may be one reason Abbey Road has become the most beloved Beatles album of all time.",
    "audio": "../assets/songs/beatles1.mp3",
    "id": 5
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-006-Nirvana-NEVERMIND-HR.jpg?w=1000",
    "artist": "Nirvana",
    "album": "Nevermind",
    "year": "1991",
    "rank": "6",
    "body1": "An overnight-success story of the 1990s, Nirvana's second album and its totemic ﬁrst single, “Smells Like Teen Spirit,” shot up from the Northwest underground — the nascent grunge scene in Seattle — to kick Michael Jackson's Dangerous off the top of the Billboard charts and blow hair metal off the map. Few albums have had such an overpowering impact on a generation — a nation of teens suddenly turned punk — and such a catastrophic effect on its main creator. The weight of success led already-troubled singer-guitarist Kurt Cobain to take his own life in 1994.",
    "body2": "But his slashing riffs, corrosive singing, and deviously oblique writing — rammed home by the Zeppelin-via-Pixies might of bassist Krist Novoselic and drummer Dave Grohl — put warrior purity back in rock & roll. Lyrically, Cobain raged in code — shorthand grenades of inner tumult and self-loathing. His genius, though, in songs like “Lithium,” “Breed,” and “Teen Spirit” was the soft-loud tension he created between verse and chorus, restraint and assault. Cobain was a pop lover at heart — and a Beatlemaniac: Nevermind co-producer Butch Vig remembered hearing Cobain play John Lennon's “Julia” at sessions. Cobain also fought to maintain his underground honor with songs like the scabrous punk purge “Territorial Pissings.”",
    "body3": "Ultimately, it was a losing battle, but it is part of this album's enduring power. Vig recalled when Cobain was forced to overdub the guitar intro to “Teen Spirit” because he couldn't nail it live with the band: “That pissed him off. He wanted to play [the song] live all the way through.”",
    "audio": "../assets/songs/nirvana.mp3",
    "id": 6
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-007-Fleetwood-Mac-RUMOURS.jpg?w=1000",
    "artist": "Fleetwood Mac",
    "album": "Rumors",
    "year": "1977",
    "rank": "7",
    "body1": "With Rumours, Fleetwood Mac turned private turmoil into gleaming, melodic public art. The band's two couples — bassist John McVie and singer-keyboard player Christine McVie, who were married; guitarist Lindsey Buckingham and vocalist Stevie Nicks, who were not — broke up during the protracted sessions for the album.",
    "body2": "As John later told Rolling Stone of the atmosphere during the making of Rumours, “Parties going on all over the house. Amazing. Terrifying. Huge amounts of illicit materials, yards and yards of this wretched stuff. Days and nights would just go on and on.”",
    "body3": "This frenzied, decadent vibe lent a highly charged, confessional aura to such songs as Buckingham's “Go Your Own Way,” Nicks' “Dreams,” Christine's “Don't Stop,” and the group-composed anthem to betrayal, “The Chain.” The band's soap opera fueled its own intricate creative conversation; on “You Make Loving Fun,” Christine sang about her new boyfriend, the band's lighting designer, as her ex John dutifully drives home the song with a sunny, funky bass line.",
    "body4": "To write “Dreams,” Nicks sat on a black velvet bed in a tiny room hidden deep in the Record Plant, where the band was recording, creating one of her most haunting songs in 10 minutes. “[In 'Go Your Own Way'] Lindsey is saying go ahead and date other men and go live your crappy life, and [I'm] singing about the rain washing you clean,” Nicks said. “We were coming at it from opposite angles, but we were really saying the same exact thing.” The Mac's catchy exposés, produced with California-sunshine polish, touched a nerve: Rumours became the sixth-best-selling album of all time.",
    "audio": "../assets/songs/fleetwoodmac.mp3",
    "id": 7
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-008-Prince-PURPLE-RAIN.jpg?w=1000",
    "artist": "Prince and the Revolution",
    "album": "Purple Rain",
    "year": "1984",
    "rank": "8",
    "body1": "“I think Purple Rain is the most avant-garde, 'purple' thing I've ever done,” Prince told Ebony in 1986. He was still a rising star with only a couple of hits when he got the audacious idea to make a movie based on his life, and make his next LP the movie's soundtrack. When it was released in 1984, he became the first artist to have the Number One song, album, and movie in North America.",
    "body2": "But Purple Rain was so much more than a huge movie soundtrack: It was a testament to Prince's dream of creating a utopian Top 40, a place where funk, psychedelia, heavy-metal shredding, huge ballads, and daring experimentalism could coexist. “Listening to Purple Rain now, it's kind of like a Beatles album,” keyboardist Matt Fink of the Revolution told Rolling Stone shortly after Prince's death in 2016. “Every song is just so brilliant in its own way — all so unique and different.”",
    "body3": "It's an incredible balance of contradicting impulses — from the pornographic “Darling Nikki” to the sparkling innocence of “Take Me With You.” When Purple Rain director Albert Magnoli asked for a good song to back a montage sequence, Prince came in the next day with “When Doves Cry,” a stark, eccentric-sounding brokenhearted song that became his first Number One single.",
    "body4": "The title track was one of several songs recorded live at his hometown club, First Avenue, in Minneapolis (strings and overdubs were added later in the studio). It was inspired by Bob Seger, of all people — when Prince was touring behind 1999 [see No. 130] in 1983, Seger was playing many of the same markets. Prince didn't understand the Midwestern rocker's appeal, but decided to try a ballad in the Seger mode — the result may be the greatest rock ballad of all time.",
    "audio": "../assets/songs/prince.mp3",
    "id": 8
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-009-Bob-Dylan-BLOOD-ON-THE-TRACKS.jpg?w=1000",
    "artist": "Bob Dylan",
    "album": "Blood on the Tracks",
    "year": "1975",
    "rank": "9",
    "body1": "Bob Dylan once introduced this album's opening song, “Tangled Up in Blue,” onstage as taking him 10 years to live and two years to write. It was, for him, a pointed reference to the personal crisis — the collapse of his marriage to Sara Lowndes — that at least partly inspired this album, Dylan's best of the 1970s.",
    "body2": "In fact, he wrote all of these lyrically piercing, gingerly majestic folk-pop songs in two months, in mid-1974. He was so proud of them that he privately auditioned almost all of the album, from start to ﬁnish, for pals and peers, including Mike Bloomﬁeld, David Crosby, and Graham Nash, before cutting them in September — in just a week, with members of the bluegrass band Deliverance.",
    "body3": "But in December, Dylan played the record for his brother, David, in Minneapolis, who suggested recutting some songs with local musicians. The ﬁnal Blood was a mix of New York and Minneapolis tapes; the New York versions are slower, more pensive, while the Minneapolis versions are faster and wilder. Together, they frame the gritty anguish in Dylan's vocals, as he rages through some of his most passionate, confessional songs — from adult breakup ballads like “You're a Big Girl Now” and “If You See Her, Say Hello” to the sharp-tongued opprobrium of “Idiot Wind,” his greatest put-down song since “Like a Rolling Stone.”",
    "body4": "“A lot of people tell me they enjoyed that album,” Dylan said soon after it became an instant commercial and critical success. “It's hard for me to relate to that — I mean, people enjoying that type of pain.” Yet Dylan had never turned so much pain into so much musical splendor.",
    "audio": "../assets/songs/bobdylan1.mp3",
    "id": 9
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-010-Lauryn-Hill-MISEDUCATION.jpg?w=1000",
    "artist": "Lauryn Hill",
    "album": "The Miseducation of Lauryn Hill",
    "year": "1998",
    "rank": "10",
    "body1": "“This is a very sexist industry,” Lauryn Hill told Essence magazine in 1998. “They'll never throw the 'genius' title to a sister.” Though already a star as co-leader of the Fugees, with Wyclef Jean, she was hungry to express her own vision. “[I wanted to] write songs that lyrically move me and have the integrity of reggae and the knock of hip-hop and the instrumentation of classic soul,” the singer said of her debut album.",
    "body2": "She took control of the recording process, writing, producing, arranging, and helming sessions that included collaborators like pianist John Legend, still in college when he got the call to go out to New Jersey, where Hill was recording, and the pathfinding R&B artist D'Angelo. They shaped a sound that went from the money-hating banger “Lost Ones” to subtle, glorious, heartbreaking monuments such as “Ex-Factor” (reportedly about Wyclef Jean) and the swinging sermon “Doo Wop (That Thing).” For “I Used to Love Him,” Hill duetted with her hip-hop-soul forebear Mary J. Blige. Each song was driven by a clarity of vision and personal honesty that felt revelatory; in “To Zion,” she detailed her struggles as an ambitious professional and a new mom.",
    "body3": "Miseducation's musical legacy is just as deep; at a time when pop was becoming increasingly slick and digitized in the go-go Nineties, here was an album that showed the commercial appeal of a rawer sound; “I wanna hear that thickness of sound,” Hill said. “You can't get that from a computer, because a computer's too perfect. But that human element, that's what makes the hair on the back of my neck stand up. I love that.”",
    "audio": "../assets/songs/laurynhill.mp3",
    "id": 10
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-011-BeatlesREVOLVER-updated.jpg?w=1000",
    "artist": "The Beatles",
    "album": "Revolver",
    "year": "1966",
    "rank": "11",
    "body1": "Revolver was the sound of the Beatles fully embracing the recording studio as a sonic canvas, free to pursue musical ideas and possibilities that would reshape rock forever. It speaks volumes that the first song the band worked on upon entering Abbey Road studios in April 1966 would have been impossible to replicate live — a swirl of hazy guitar, backward tape loops, kaleidoscopic drum tumble, and John Lennon's voice recorded to sound like “the Dalai Lama singing from the highest mountaintop.” They titled it “The Void” and later renamed it “Tomorrow Never Knows.” “I was wondering how George Martin would take it,” Paul McCartney later recalled. Martin's response: “Jolly interesting.”",
    "body2": "The Beatles' lives were changing too: Lennon had taken LSD at this point, George Harrison was deepening his interest in Eastern mysticism, and McCartney was getting into avant-garde composition. All those influences came through here.",
    "body3": "Revolver wasn't totally without precedent. The Beatles' previous album, Rubber Soul [see No. 35], had a similar experimental introspect. Harrison once said Rubber Soul and Revolver “could be volume one and volume two.” But no band, including the Beatles, had tried anything like McCartney's strikingly mature art song “Eleanor Rigby,” Lennon's trippy tape-loop swirl “I'm Only Sleeping,” or Harrison's “Taxman,” with its cutting groove and lyrics that took shots at British politicians.",
    "body4": "It made sense that the disappointing live shows the band played in the summer of 1966 would be their last. By the time Revolver came out, they'd already entered another world.",
    "audio": "../assets/songs/beatles2.mp3",
    "id": 11
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-012-MichaelJacksonThriller.jpg?w=1000",
    "artist": "Michael Jackson",
    "album": "Thriller",
    "year": "1982",
    "rank": "12",
    "body1": "Michael Jackson towered over the Eighties the way no superstar before or since has dominated an era — not even Elvis or the Beatles. And Thriller is the reason why. Still in his early twenties, the R&B child star of the 1970s had ripened into a Technicolor soul man: a singer, dancer, and songwriter with incomparable crossover instincts.",
    "body2": "He and producer Quincy Jones established the something-for-everyone template of Thriller on 1979's Off the Wall [see No. 36], on which Jackson captures the rare mania of his life — the applause and paranoia, the need for love and the fear of commitment — in a crisp fusion of pop hooks and dance beats. On Thriller, the pair heighten the sheen (the jaunty gloss of “The Girl Is Mine,” with a guest vocal by Paul McCartney), pump up the theater (the horror-movie spectacular “Thriller”), and deepen the funk. With its locomotive cadence and an acrobatic metal-guitar solo by Eddie Van Halen, “Beat It” was arguably the first industrial-disco Number One.",
    "body3": "It is hard now to separate Thriller from its commercial stature (Number One for 37 weeks, 33 million copies sold), the nightmarish tabloid celebrity that led to Jackson's death, and the horrific revelations about him that have surfaced in recent years. But there was a time when we only knew Jackson as the King of Pop. This is it.",
    "audio": "../assets/songs/mj.mp3",
    "id": 12
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-013-ArethaFrankNEVERLOVED-H.jpg?w=1000",
    "artist": "Aretha Franklin",
    "album": "I Never Loved a Man the Way I Love You",
    "year": "1967",
    "rank": "13",
    "body1": "Aretha Franklin's Atlantic debut is the place where gospel music collided with R&B and rock & roll and became soul. The Detroit-born preacher's daughter was about $80,000 in debt to her previous label, Columbia, when Atlantic producer Jerry Wexler signed her in 1966. “I took her to church,” Wexler said, “sat her down at the piano, and let her be herself.”",
    "body2": "Recording with the best session men at FAME Studios in Muscle Shoals, Alabama, she promptly cut the album's title hit, a slow-fire ballad of ferocious sexuality. The historic moment, of course, was her storefront-church makeover of Otis Redding's “Respect,” which became Franklin's first Number One pop single, prompting Redding to exclaim, “I just lost my song.” Soon, it would be the new marching anthem of the women's and civil rights movements.",
    "body3": "“Women did, and still do, need equal rights,” Franklin said decades later. “We're doing the same job, we expect the same pay, and the same respect.” She reinforced that feminism on “Do Right Woman, Do Right Man” and had the guts to wring more pathos from Sam Cooke's civil rights anthem, “A Change Is Gonna Come,” than any other singer who has attempted that landmark song. Never Loved a Man began an unparalleled run of classic albums for Franklin; it's the sound of the Queen of Soul claiming her crown.",
    "audio": "../assets/songs/arethafranklin.mp3",
    "id": 13
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-014-Rolling-Stones-EXILE-ON-MAIN-ST.jpg?w=1000",
    "artist": "The Rolling Stones",
    "album": "Exile on Main Street",
    "year": "1972",
    "rank": "14",
    "body1": "A dirty whirl of basement blues and punk boogie, the Rolling Stones' 1972 double LP was, according to Keith Richards, “maybe the best thing we did.” Indeed, inside its deliberately dense squall — Richards' and Mick Taylor's dogﬁght riffing, the lusty jump of the Bill Wyman-Charlie Watts rhythm engine, Mick Jagger's caged-animal bark and burned-soul croon — is the Stones' greatest album and Jagger and Richards' deﬁnitive songwriting statement of outlaw pride and dedication to grit and cold-morning redemption.",
    "body2": "In the existential shuffle of “Tumbling Dice,” the exhausted country beauty of “Torn and Frayed,” and the whiskey-soaked church of “Shine a Light,” you literally hear the Stones in exile: working at Richards' villa in the South of France, on the run from media censure, British drug police (Jagger and Richards had been busted and arrested before), and the U.K.'s then-onerous tax code. The music rattles with corrosive abandon but also swings with a clear purpose — unconditional survival — in “Rocks Off” and “All Down the Line.”",
    "body3": "As Richards explained, “The Stones don't have a home anymore — hence the exile — but they can still keep it together. Whatever people throw at us, we can still duck, improvise, overcome.” Great example: Richards recorded his jubilant romp “Happy” with only producer Jimmy Miller on drums and sax man Bobby Keys, while waiting for the other Stones to turn up for work. Exile on Main Street is the band at its ﬁghting best, armed with the blues, playing to win.",
    "audio": "../assets/songs/rollingstones.mp3",
    "id": 14
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-015-Public-Enemy-IT-TAKES-A-NATION-H.jpg?w=1000",
    "artist": "Public Enemy",
    "album": "It Takes a Nation of Millions to Hold Us Back",
    "year": "1988",
    "rank": "15",
    "body1": "Loud, obnoxious, funky, avant-garde, political, uncompromising, hilarious - Public Enemy's brilliant second album is all of these things — all at once. Chuck D booms intricate rhymes with a delivery inspired by sportscaster Marv Albert; sidekick Flavor Flav raps comic relief; and production team the Bomb Squad build mesmerizing, multilayered jams, pierced with shrieking sirens.",
    "body2": "The title and roiling force of “Bring the Noise” is truth in advertising. “If they're calling my music 'noise,' ” said Chuck D, “if they're saying that I'm really getting out of character being a black person in America, then fine - I'm bringing more noise.”",
    "body3": "Along with “Bring the Noise,” Nation classics like “Rebel Without a Pause” were conceived at Spectrum City in the band headquarters in Hempstead, New York. For “Rebel,” producer Hank Shocklee of the Bomb Squad looped a piercing sample of James Brown's “The Grunt” with Brown's “Funky Drummer” (“That song was like my milk,” said Shocklee). To write verses that could match such a sonic assault, Chuck locked himself in his house for 24 hours and emerged with broadsides like the media screed “Don't Believe the Hype.” He wasn't sure of the results until DMC, of Run-DMC, blasted it out of his Bronco on a Saturday night. Says Shocklee, “The whole block was grooving to it.”",
    "audio": "../assets/songs/publicenemy.mp3",
    "id": 15
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/016-Clash-LONDON-CALLING.jpg?w=1000",
    "artist": "The Clash",
    "album": "London Calling",
    "year": "1979",
    "rank": "16",
    "body1": "Recorded in 1979 in London, which was then wrenched by surging unemployment and drug addiction, and released in America in January 1980, the dawn of an uncertain decade, London Calling is 19 songs of apocalypse fueled by an unbending faith in rock & roll to beat back the darkness. Produced with no-surrender energy by legendary Sixties studio madman Guy Stevens, the Clash's third album sounds like a free-form radio broadcast from the end of the world, skidding from bleak punk (“London Calling”) to rampaging ska (“Wrong 'Em Boyo”) and disco resignation (“Lost in the Supermarket”).",
    "body2": "The album was made in dire straits too. Although the Clash ﬁred singles into the Britain's Top 40 with machine-gun regularity, the band was heavily in debt and openly at war with its record company. Singer-guitarists Joe Strummer and Mick Jones, the Clash's Lennon and McCartney, wrote together in Jones' grandmother's ﬂat, where he was living for lack of dough. “Joe, once he learned how to type, would bang the lyrics out at a high rate of good stuff,” Jones noted. “Then I'd be able to bang out some music while he was hitting the typewriter.” Stevens was on hand for inspiration. He threw chairs around the room “if he thought a track needed zapping up,” according to Strummer. The album ends with “Train in Vain,” a rousing song of ﬁdelity (originally unlisted on the back cover) that became the sound of triumph: the Clash's ﬁrst Top 30 single in the U.S.",
    "audio": "../assets/songs/clash.mp3",
    "id": 16
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-017-Kanye-My-Beautiful-Dark-Twisted-Fantasy.jpg?w=1000",
    "artist": "Kanye West",
    "album": "My Beautiful Dark Twisted Fantasy",
    "year": "2010",
    "rank": "17",
    "body1": "Our relationship with Kanye West was still in its love-hate phase when he created the 21st century's most awe-inspiring hip-hop masterpiece. It's an album every bit as chaotic as he was at the time — from the creepy funk of “Gorgeous” to the crushing attack of “Hell of a Life.” After his Taylor Swift VMAs fiasco in 2009, West went into a kind of self-exile, eventually ending up in Hawaii, where he imported a huge group of collaborators who included Justin Vernon of Bon Iver, Nicki Minaj, and RZA.",
    "body2": "In all-night recording sessions, he'd ping between studios, sculpting his most maximalist music ever; “a song like 'Power' took 5,000 hours,” he later said, “like literally.” West pulled from everywhere — Elton John played on “All of the Lights,” and “Power” sampled prog-rockers King Crimson. West's sense of his own grandiose ambitions bordered on the comical; during the writing process for the nine-minute “Runaway,” he famously told guest rapper Pusha T to add “more douchebag” to his verses.",
    "body3": "The resulting track opened with just a single, eerie piano note before building into a mountainous, anarchic tune that incorporated everything from a Rick James sample to a vocoder that evoked Robert Fripp's guitar playing on Brian Eno albums.",
    "body4": "The sonic overkill was lavish, but the record hit so hard because he mixed megalomania with introspect; “You been puttin' up wit' my shit just way too long,” he rapped on “Runaway.” West later called Dark Fantasy an apology record.” Perhaps. In any case, that wisdom has proved fleeting.",
    "audio": "../assets/songs/kanye.mp3",
    "id": 17
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-018-Bob-Dylan-HWY-61-REVISITED-updated.jpg?w=1000",
    "artist": "Bob Dylan",
    "album": "Highway 61 Revisited",
    "year": "1965",
    "rank": "18",
    "body1": "Bruce Springsteen has described the beginning of “Like a Rolling Stone,” the opening song on Bob Dylan's Highway 61 Revisited, as the “snare shot that sounded like somebody'd kicked open the door to your mind.” In and of itself, “Like a Rolling Stone,” which was rumored to be about Andy Warhol acolyte Edie Sedgwick, forever altered the landscape of popular music — its “vomitiﬁc” lyrics (in Dylan's memorable term), literary ambition, and sheer length (6:13) shattered limitations of every kind. But that was literally only the beginning.",
    "body2": "The rest of the album, recorded in a shocking six days, was just as revelatory. If anyone questioned whether or not Dylan had truly “gone electric,” the roaring rock & roll of “From a Buick 6” and “Tombstone Blues” — both powered by legendary guitarist Mike Bloomﬁeld of the Paul Butterﬁeld Blues Band — left no doubt. The album ends with “Desolation Row,” a swirling 11-minute surrealist night journey of indescribable power, a Hieronymus Bosch-like season in hell that, in retrospect, seems to foretell all the Sixties cataclysms to come. Not that Dylan wasn't having fun all the while as well. The toy siren that opens the album's title track was keyboardist's Al Kooper's playful way of policing the recording sessions for Highway 61 Revisited. “If anybody started using drugs anywhere,” he explained, “I'd walk into the opposite corner of the room and just go whooooooooo.”",
    "audio": "../assets/songs/bobdylan2.mp3",
    "id": 18
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-019-Kendrick-Lamar-To-Pimp-a-Butterfly.jpg?w=1000",
    "artist": "Kendrick Lamar",
    "album": "To Pimp a Butterfly",
    "year": "2015",
    "rank": "19",
    "body1": "Kendrick Lamar had already proven himself hip-hop's boldest visionary — so by now, people expected greatness from him. But he topped himself with To Pimp a Butterfly — a sprawling, ambitious portrait of America and his dangerous place in it, with a host of jazz influences.",
    "body2": "“It's a unique sound,” said longtime Lamar producer Mark “Sounwave” Spears. “Every producer I've ever met was sending me stuff [for the album], but there was a one-in-a-million chance you could send a beat that actually fit what we were doing.” As Lamar said when the album was released, “I pride myself on writing now rather than rapping. My passion is bringing storylines around and constructing a full body of work, rather than just a 16-bar verse.”",
    "body3": "“Alright” became a Black Lives Matter anthem, with “The Blacker the Berry” as the flip side. “How Much a Dollar Cost” is a haunting meditation on mortality, set to a Radiohead piano loop. And in “King Kunta,” K-Dot takes in the whole sweep of African American heartbreak, from the Middle Passage to the hood, from Richard Pryor to P-Funk. “You take a black kid out of Compton and put him in the limelight, and you find answers about yourself you never knew you were searching for,” Lamar said. “There's some stuff in there, man. It's a roller coaster. It builds.”",
    "audio": "../assets/songs/kendricklamar.mp3",
    "id": 19
  },
  {
    "cover": "https://www.rollingstone.com/wp-content/uploads/2020/09/R1344-020-Radiohead-KID-A.jpg?w=1000",
    "artist": "Radiohead",
    "album": "Kid A",
    "year": "2000",
    "rank": "20",
    "body1": "A new, uniquely fearless kind of rock record for a new, increasingly fearful century, Radiohead's fourth album, released in October 2000, remains one of the more stunning sonic makeovers in music history. The band had the freedom to do whatever it wanted after its 1997 alt-rock breakthrough, OK Computer. “Everyone expected us to become this U2 type of band, with that stadium credibility,” bassist Colin Greenwood said in 2001.",
    "body2": "Instead, frontman Thom Yorke gorged on albums by avant-techno innovator Aphex Twin and other artists on the Warp Records roster, inspiring him to put down his guitar and embrace the glacial beauty of abstract electronics, glitchy beats, and the challenge of free-form composition. “It was difficult for the others [in the band], 'cause when you're working with a synthesizer it's like there's no connection,” Yorke said in 2017. What emerged was at once scary and enveloping, pitched between deep alienation and profound tenderness — from the womblike ambient flow of “Everything in Its Right Place” to the free-jazz implosion “The National Anthem” to the gizmo-groove paranoia of “Idioteque.”",
    "body3": "“I find it difficult to think of the path we've chosen as 'rock music,' ” Yorke told Rolling Stone in 2000. “Kid A is like getting a massive eraser out and starting again.”",
    "audio": "../assets/songs/radiohead.mp3",
    "id": 20
  }
]